#+TITLE: Emacs Ruby Debugging and Profiling
#+AUTHOR: AoC Ruby Tutorials
#+PROPERTY: header-args:ruby :results output :exports both
#+PROPERTY: header-args:elisp :lexical t
#+STARTUP: overview

** Session-Based Development

#+BEGIN_SRC ruby :session irb
# Define methods in session
def fib(n)
  n < 2 ? n : fib(n-1) + fib(n-2)
end

"fib defined"
#+END_SRC

#+RESULTS:
: fib defined

#+BEGIN_SRC ruby :session irb
# Use in subsequent blocks
(1..10).map { |n| fib(n) }.inspect
#+END_SRC

#+RESULTS:
: [1, 1, 2, 3, 5, 8, 13, 21, 34, 55]

** Inspecting Variables

#+BEGIN_SRC ruby :session debug-demo
# Use pp for pretty inspection
require 'pp'

data = {
  users: [
    {name: "Alice", score: 100},
    {name: "Bob", score: 85}
  ],
  metadata: {version: 1, format: "json"}
}

pp data
#+END_SRC

#+RESULTS:
: {:users=>[{:name=>"Alice", :score=>100}, {:name=>"Bob", :score=>85}],
:  :metadata=>{:version=>1, :format=>"json"}}

** Tracing Execution

#+BEGIN_SRC ruby
# TracePoint for method calls
def traced_execution
  calls = []

  trace = TracePoint.new(:call) do |tp|
    calls << "#{tp.defined_class}##{tp.method_id}" if tp.path == "(eval)"
  end

  trace.enable do
    [1, 2, 3].map { |x| x * 2 }.sum
  end

  calls.uniq.first(5)
end

puts traced_execution.inspect
#+END_SRC

#+RESULTS:
: []

** Execution Timing

#+BEGIN_SRC ruby
def timed(label = "Block")
  start = Process.clock_gettime(Process::CLOCK_MONOTONIC)
  result = yield
  elapsed = Process.clock_gettime(Process::CLOCK_MONOTONIC) - start
  puts "#{label}: #{(elapsed * 1000).round(3)}ms"
  result
end

timed("Sum 1M") { (1..1_000_000).sum }
timed("Map sum") { (1..1_000_000).map { |x| x }.sum }
nil
#+END_SRC

#+RESULTS:
: Sum 1M: 12.629ms
: Map sum: 66.413ms

** Quick Timing in Org

#+BEGIN_SRC ruby
require 'benchmark'

Benchmark.bm(12) do |x|
  data = (1..100_000).to_a

  x.report("select+map:") do
    100.times { data.select { |n| n.odd? }.map { |n| n * 2 } }
  end

  x.report("filter_map:") do
    100.times { data.filter_map { |n| n * 2 if n.odd? } }
  end
end
#+END_SRC

#+RESULTS:
:                    user     system      total        real
: select+map:    0.532158   0.011930   0.544088 (  0.544129)
: filter_map:    0.395880   0.000000   0.395880 (  0.395929)

** Memory Allocation Tracking

#+BEGIN_SRC ruby
require 'objspace'

def track_allocations
  GC.disable
  before = ObjectSpace.count_objects[:T_ARRAY]
  yield
  after = ObjectSpace.count_objects[:T_ARRAY]
  GC.enable
  after - before
end

# Compare array creation methods
puts "Array.new: #{track_allocations { Array.new(1000) { |i| i } }} arrays"
puts "Range#to_a: #{track_allocations { (0...1000).to_a }} arrays"
puts "map: #{track_allocations { 1000.times.map { |i| i } }} arrays"
#+END_SRC

#+RESULTS:
: Array.new: 2 arrays
: Range#to_a: 1 arrays
: map: 2 arrays

** 1. Start with Org Babel Sessions

Keep state across code blocks for iterative development:

#+BEGIN_SRC ruby :session aoc
INPUT = "1\n2\n3\n4\n5"
LINES = INPUT.lines.map(&:chomp).map(&:to_i)
"Input loaded: #{LINES.size} lines"
#+END_SRC

#+RESULTS:
: Input loaded: 5 lines

#+BEGIN_SRC ruby :session aoc
# Test solutions incrementally
def part1(data) = data.sum
def part2(data) = data.map { |x| x * 2 }.sum

puts "Part 1: #{part1(LINES)}"
puts "Part 2: #{part2(LINES)}"
#+END_SRC

#+RESULTS:
: Part 1: 15
: Part 2: 30

** 4. Profile Before Optimizing

Always measure first:

#+BEGIN_SRC ruby
require 'benchmark'

def measure_both(n = 100_000)
  data = (1..n).to_a

  Benchmark.bmbm(15) do |x|
    x.report("original:") { data.select { |i| i > n/2 }.sum }
    x.report("optimized:") { data.sum { |i| i > n/2 ? i : 0 } }
  end
end

measure_both(50_000)
#+END_SRC

#+RESULTS:
#+begin_example
Rehearsal ---------------------------------------------------
original:         0.004015   0.000000   0.004015 (  0.004015)
optimized:        0.002568   0.000000   0.002568 (  0.002572)
------------------------------------------ total: 0.006583sec

                      user     system      total        real
original:         0.003889   0.000000   0.003889 (  0.003889)
optimized:        0.002544   0.000000   0.002544 (  0.002544)
#+end_example

